snlkuharlocal/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКонтрагентов</registerRecords>
  <attributes>
    <name>b2b_Дозаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПерегруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПерегруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАМЭкспедитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОформления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидкаНаНакладную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗаказа</name>
    <type>
      <types>EnumRef.ИсточникЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВторичногоКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВторичногоКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>неКонтролироватьДублиСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВторичногоКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НулеваяСтавкаНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикПоАгентскойСхеме</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПерегруза</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДоставки</name>
    <type>
      <types>CatalogRef.РайоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияЗаказаКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСогласования</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЭкспедитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРаспродажа</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоЭкспедитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладМаркировки</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеНакладные</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДвижения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/КатегорииОбъектов/КатегорииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КатегорииОбъектов</name>
  <comment>(Общ)</comment>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КатегорииОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/Заказ/ManagerModule.bsl
Функция ОпределитьПризнакЗаказаССайта(ЗаказСсылка) Экспорт
	
	МассивЗаказов = Новый Массив;
	МассивЗаказов.Добавить(ЗаказСсылка);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаказов", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК ДокументСсылка
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	|		ПО (КатегорииОбъектов.Объект = Заказ.Ссылка)
	|			И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ЗаказСWEBСайта))
	|ГДЕ
	|	Заказ.Ссылка В(&МассивЗаказов)
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ?(НЕ Рез.Пустой(), Истина, Ложь);
	
КонецФункции

Функция ПолучитьСтруктуруОстатков(ЗаказСсылка, МассивСкладов = Неопределено, МассивНоменклатуры = Неопределено, ВидДокумента = "Заказ") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЗаказСсылка.Дата);
	Запрос.УстановитьПараметр("Ссылка", ЗаказСсылка);
	
	Если МассивСкладов = Неопределено Тогда
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(ЗаказСсылка.Склад);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	ТекстНоменклатуры = "";
	Если МассивНоменклатуры <> Неопределено Тогда
		ТекстНоменклатуры = "И Номенклатура В (&МассивНоменклатуры)";
		Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Иначе
		ТекстНоменклатуры = "И Номенклатура В
		|						(ВЫБРАТЬ
		|							Товары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							Документ." + ВидДокумента + ".Товары КАК Товары
		|						ГДЕ
		|							Товары.Ссылка = &Ссылка)";
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ТаблицаОстатков, ТаблицаНехватки");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, Товары.Номенклатура) КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) < ЕСТЬNULL(Товары.Количество, 0)
	|			ТОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(Товары.Количество, 0)
	|	КОНЕЦ КАК Количество,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) < ЕСТЬNULL(Товары.Количество, 0)
	|			ТОГДА ЕСТЬNULL(Товары.Количество, 0) - (ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0))
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Нехватка
	|ИЗ
	|	Документ." + ВидДокумента + ".Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	|				&Дата,
	|				Склад В (&МассивСкладов)
	|					" + ТекстНоменклатуры + "
	|					) КАК ОстаткиТМЦОстатки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	//Кухарь А.Ю.  02.05.2023 начало
	//	|					&Дата,
	|					,	 
	//Кухарь А.Ю.  02.05.2023 конец	
	|					Склад В (&МассивСкладов)
	|						" + ТекстНоменклатуры + "
	|						) КАК РезервыТМЦОстатки
	|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|		ПО Товары.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаНехватки = ТаблицаОстатков.СкопироватьКолонки();
	Для Каждого Стр ИЗ ТаблицаОстатков Цикл
		Если Стр.Нехватка > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаНехватки.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.Вставить("ТаблицаОстатков", ТаблицаОстатков);
	СтруктураВозврата.Вставить("ТаблицаНехватки", ТаблицаНехватки);
	
	Возврат СтруктураВозврата;
	
КонецФункции

///////// ТАБЛИЦА НЕХВАТКИ ///////////////////////////////////////////////////////////////////////////
// Колонки: Номенклатура, Нехватка (Количество)

// Кухарь А.Ю.  19.04.2023 начало
// Функция ПолучитьСтруктуруОстатковПоТаблицеНехватки(ЗаказСсылка, ТаблицаНехватки = Неопределено, МассивСкладов = Неопределено) Экспорт
Функция ПолучитьСтруктуруОстатковПоТаблицеНехватки(ЗаказСсылка, ТаблицаНехватки = Неопределено, МассивСкладов = Неопределено,ДатаОстатков=Неопределено,ОставлятьНули=Истина) Экспорт
	// Кухарь А.Ю.  19.04.2023 конец
	Если МассивСкладов = Неопределено Тогда
		МассивСкладов = Новый Массив;
		МассивСкладов.Добавить(ЗаказСсылка.Склад);
	КонецЕсли;
	
	
	СтруктураВозврата = Новый Структура("ТаблицаОстатков, ТаблицаНехватки");
	
	Запрос = Новый Запрос;
	////////////////////////// ВНЕШНЯЯ ТАБЛИЦА ////////////////////////////////////////////////////////
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	// Кухарь А.Ю.  02.05.2023 начало
	// 	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаНехватки ИЗ &ТаблицаНехватки КАК ТаблицаНехватки
	Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТаблицаНехватки ИЗ &ТаблицаНехватки КАК ТаблицаНехватки где (ТаблицаНехватки.Нехватка<>0 или  &ОставлятьНули)	 
	// Кухарь А.Ю.  02.05.2023 конец
	
	
	// Кухарь А.Ю.  19.04.2023 начало
	
	|;
	|ВЫБРАТЬ
	|	РезервыТМЦ.Номенклатура КАК Номенклатура,
	|	РезервыТМЦ.Количество КАК КоличествоОстаток
	|ПОМЕСТИТЬ РезервыДляВычитания
	|ИЗ
	|	РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|ГДЕ
	|	РезервыТМЦ.Регистратор = &ЗаказСсылка
	|и РезервыТМЦ.Склад в (&МассивСкладов)";
	Запрос.УстановитьПараметр("ТаблицаНехватки", ТаблицаНехватки);
	запрос.УстановитьПараметр("ЗаказСсылка",ЗаказСсылка);
	запрос.УстановитьПараметр("МассивСкладов",МассивСкладов);
	
	
	// Кухарь А.Ю.  02.05.2023 начало
	запрос.УстановитьПараметр("ОставлятьНули",ОставлятьНули);	 
	// Кухарь А.Ю.  02.05.2023 конец
	
	// Кухарь А.Ю.  19.04.2023 конец
	
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////
	
	
	// Кухарь А.Ю.  19.04.2023 начало
	// 	Запрос.УстановитьПараметр("Дата", ЗаказСсылка.Дата);
	если ДатаОстатков=Неопределено тогда
		Запрос.УстановитьПараметр("Дата", ЗаказСсылка.Дата);
	иначе
		Запрос.УстановитьПараметр("Дата", ДатаОстатков);
	КонецЕсли;
	// Кухарь А.Ю.  19.04.2023 конец
	
	
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Запрос.УстановитьПараметр("МассивНоменклатуры", ТаблицаНехватки.ВыгрузитьКолонку("Номенклатура"));
	
	//++Данилова Е.В. 09.04.2025 HELP-4082
	// Шворобей ВЮ 07.02.2023 ++
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ЕСТЬNULL(ТаблицаНехватки.Номенклатура, ОстаткиТМЦОстатки.Номенклатура) КАК Номенклатура,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0)
	//|				ТОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)
	//|			ИНАЧЕ ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0)
	//|		КОНЕЦ) КАК Количество,
	//|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)) КАК СвободныйОстаток,
	//|	СУММА(ВЫБОР
	//|			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0)
	//|				ТОГДА ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0) - (ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0))
	//|			ИНАЧЕ 0
	//|		КОНЕЦ) КАК Нехватка,
	//|	МАКСИМУМ(ОстаткиТМЦОстатки.Склад) КАК Склад
	//|ИЗ
	//|	ТаблицаНехватки КАК ТаблицаНехватки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	//|				&Дата,
	//|				Склад В (&МассивСкладов)
	//|					И Номенклатура В (&МассивНоменклатуры)) КАК ОстаткиТМЦОстатки
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	////Кухарь А.Ю.  02.05.2023 начало
	////	|					&Дата,
	//|					,	 
	////Кухарь А.Ю.  02.05.2023 конец	
	//
	//|					Склад В (&МассивСкладов)
	//|						И Номенклатура В (&МассивНоменклатуры)) КАК РезервыТМЦОстатки
	//|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	//|				и ОстаткиТМЦОстатки.КоличествоОстаток>0
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РезервыДляВычитания КАК РезервыДляВычитания
	//|			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыДляВычитания.Номенклатура
	//|		ПО ТаблицаНехватки.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ЕСТЬNULL(ТаблицаНехватки.Номенклатура, ОстаткиТМЦОстатки.Номенклатура)";
	// Шворобей ВЮ 07.02.2023 ++ 
	
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЕСТЬNULL(ТаблицаНехватки.Номенклатура, ОстаткиТМЦОстатки.Номенклатура) КАК Номенклатура,
	 |	СУММА(ВЫБОР
	 |			КОГДА ВЫБОР
	 |					КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < 0
	 |						ТОГДА 0
	 |					ИНАЧЕ ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)
	 |				КОНЕЦ < ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0)
	 |				ТОГДА ВЫБОР
	 |						КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < 0
	 |							ТОГДА 0
	 |						ИНАЧЕ ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)
	 |					КОНЕЦ
	 |			ИНАЧЕ ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0)
	 |		КОНЕЦ) КАК Количество,
	 |	СУММА(ВЫБОР
	 |			КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < 0
	 |				ТОГДА 0
	 |			ИНАЧЕ ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)
	 |		КОНЕЦ) КАК СвободныйОстаток,
	 |	СУММА(ВЫБОР
	 |			КОГДА ВЫБОР
	 |					КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < 0
	 |						ТОГДА 0
	 |					ИНАЧЕ ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)
	 |				КОНЕЦ < ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0)
	 |				ТОГДА ЕСТЬNULL(ТаблицаНехватки.Нехватка, 0) - (ВЫБОР
	 |						КОГДА ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0) < 0
	 |							ТОГДА 0
	 |						ИНАЧЕ ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(РезервыДляВычитания.КоличествоОстаток, 0)
	 |					КОНЕЦ)
	 |			ИНАЧЕ 0
	 |		КОНЕЦ) КАК Нехватка,
	 |	МАКСИМУМ(ОстаткиТМЦОстатки.Склад) КАК Склад
	 |ИЗ
	 |	ТаблицаНехватки КАК ТаблицаНехватки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ.Остатки(
	 |				&Дата,
	 |				Склад В (&МассивСкладов)
	 |					И Номенклатура В (&МассивНоменклатуры)) КАК ОстаткиТМЦОстатки
	 |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	 |					,
	 |					Склад В (&МассивСкладов)
	 |						И Номенклатура В (&МассивНоменклатуры)) КАК РезервыТМЦОстатки
	 |			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	 |				И (РезервыТМЦОстатки.КоличествоОстаток > 0)
	 |			ЛЕВОЕ СОЕДИНЕНИЕ РезервыДляВычитания КАК РезервыДляВычитания
	 |			ПО ОстаткиТМЦОстатки.Номенклатура = РезервыДляВычитания.Номенклатура
	 |		ПО ТаблицаНехватки.Номенклатура = ОстаткиТМЦОстатки.Номенклатура
	 |			И (ОстаткиТМЦОстатки.КоличествоОстаток > 0)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ЕСТЬNULL(ТаблицаНехватки.Номенклатура, ОстаткиТМЦОстатки.Номенклатура)"; 
	
	//--Данилова Е.В. 09.04.2025
	
	УстановитьПривилегированныйРежим(Истина);
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ТаблицаНехватки =  ТаблицаОстатков.СкопироватьКолонки();
	Для Каждого Стр ИЗ ТаблицаОстатков Цикл
		Если Стр.Нехватка > 0 Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаНехватки.Добавить(), Стр);
		КонецЕсли;
	КонецЦикла;
	
	СтруктураВозврата.Вставить("ТаблицаОстатков", ТаблицаОстатков);
	СтруктураВозврата.Вставить("ТаблицаНехватки", ТаблицаНехватки);
	
	Возврат СтруктураВозврата;
	
КонецФункции

//--Данилова Е.В. 01.04.2025
	// Кухарь А.Ю.  29.08.2023 начало
	//  Функция ОбработатьЗаказПриСозданииРНК(ЗаказСсылка) Экспорт
Функция ОбработатьЗаказПриСозданииРНК(ЗаказСсылка,РНКСсылка=Неопределено) Экспорт
	// Кухарь А.Ю.  29.08.2023 конец
	
	
	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	Если ЗаказОбъект <> Неопределено Тогда
		
		Попытка
			ЗаказОбъект.Заблокировать();
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
		ЗаказОбъект.СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ;
		// Кухарь А.Ю.  29.08.2023 начало
		//
		если ложь тогда ЗаказОбъект=документы.Заказ.СоздатьДокумент();КонецЕсли;
		если РНКСсылка<>Неопределено тогда
			СтрТЧ=ЗаказОбъект.РасходныеНакладные.Найти(РНКСсылка,"Документ");
			если СтрТЧ=Неопределено тогда
				СтрТЧ=ЗаказОбъект.РасходныеНакладные.Добавить();
				СтрТЧ.Документ=РНКСсылка;
			КонецЕсли;
			
		КонецЕсли;
		// Кухарь А.Ю.  29.08.2023 конец
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗаказОбъект.Разблокировать();
		Исключение
			Возврат Ложь;
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ОбщиеПроверкиПолучитьСтруктуру(МассивЗаказов) Экспорт
	
	МассивКонтрагентов = Новый Массив;
	МассивСкладов = Новый Массив;
	МассивСостоянийСогласования = Новый Массив;
	МассивПроведения = Новый Массив;
	МассивЗаполнения = Новый Массив;
	МассивРНК = Новый Массив;
	МассивМенеджеров = Новый Массив;
	//++Данилова Е.В. 01.04.2025 HELP-3176
	МассивСкладовМаркировки = Новый Массив;
	//--Данилова Е.В. 01.04.2025
	
	СтруктураОтвета = Новый Структура("МассивКонтрагентов, МассивСкладов, МассивСостоянийСогласования, МассивПроведения, МассивЗаполнения, МассивРНК, МассивМенеджеров");
	
	Для Каждого Заказ Из МассивЗаказов Цикл
		
		НайденныйКонтрагент = МассивКонтрагентов.Найти(Заказ.Контрагент);
		Если НайденныйКонтрагент = Неопределено Тогда
			МассивКонтрагентов.Добавить(Заказ.Контрагент);
		КонецЕсли;
		
		НайденныйМенеджер = МассивМенеджеров.Найти(Заказ.Менеджер);
		Если НайденныйМенеджер = Неопределено И Заказ.Менеджер <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
			МассивМенеджеров.Добавить(Заказ.Менеджер);
		КонецЕсли;
		
		НайденныйСклад = МассивСкладов.Найти(Заказ.Склад);
		Если НайденныйСклад = Неопределено Тогда
			МассивСкладов.Добавить(Заказ.Склад);
		КонецЕсли;
		
		НайденноеСостояние = МассивСостоянийСогласования.Найти(Заказ.СостояниеСогласования);
		Если НайденноеСостояние = Неопределено Тогда
			МассивСостоянийСогласования.Добавить(Заказ.СостояниеСогласования);
		КонецЕсли;
		
		НайденноеСостояниеПроведения = МассивПроведения.Найти(Заказ.Проведен);
		Если НайденноеСостояниеПроведения = Неопределено Тогда
			МассивПроведения.Добавить(Заказ.Проведен);
		КонецЕсли;
		
		ФлагЗаполнения = Заказ.РасходныеНакладные.Количество() > 0;
		НайденноеСостояниеЗаполнения = МассивЗаполнения.Найти(ФлагЗаполнения);
		Если НайденноеСостояниеЗаполнения = Неопределено Тогда
			МассивЗаполнения.Добавить(ФлагЗаполнения);
		КонецЕсли;
		
		Для Каждого СтрокаРНК ИЗ Заказ.РасходныеНакладные Цикл
			НайденнаяРНК = МассивРНК.Найти(СтрокаРНК.Документ);
			Если НайденнаяРНК = Неопределено Тогда
				МассивРНК.Добавить(СтрокаРНК.Документ);
			КонецЕсли;
		КонецЦикла;
		//++Данилова Е.В. 01.04.2025 HELP-3176
		НайденныйСклад = МассивСкладовМаркировки.Найти(Заказ.СкладМаркировки);
		Если НайденныйСклад = Неопределено Тогда
			МассивСкладовМаркировки.Добавить(Заказ.СкладМаркировки);
		КонецЕсли;
		//--Данилова Е.В. 01.04.2025
		
	КонецЦикла;
	
	СтруктураОтвета.Вставить("МассивКонтрагентов", МассивКонтрагентов);
	СтруктураОтвета.Вставить("МассивСкладов", МассивСкладов);
	СтруктураОтвета.Вставить("МассивСостоянийСогласования", МассивСостоянийСогласования);
	СтруктураОтвета.Вставить("МассивПроведения", МассивПроведения);
	СтруктураОтвета.Вставить("МассивЗаполнения", МассивЗаполнения);
	СтруктураОтвета.Вставить("МассивРНК", МассивРНК);
	СтруктураОтвета.Вставить("МассивМенеджеров", МассивМенеджеров);
	//++Данилова Е.В. 01.04.2025 HELP-3176
	СтруктураОтвета.Вставить("МассивСкладовМаркировки", МассивСкладовМаркировки);
	//--Данилова Е.В. 01.04.2025
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПроверкаОстатковПоДополнительнымДвижениям(МассивЗаказов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРегистраторов", МассивЗаказов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказДополнительныеСклады.Склад КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	Документ.Заказ.ДополнительныеСклады КАК ЗаказДополнительныеСклады
	|ГДЕ
	|	ЗаказДополнительныеСклады.Ссылка В(&МассивРегистраторов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Заказ.Склад
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|ГДЕ
	|	Заказ.Ссылка В(&МассивРегистраторов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаСклады.Склад КАК Склад
	|ИЗ
	|	ТаблицаСклады КАК ТаблицаСклады";
	
	УстановитьПривилегированныйРежим(Истина);
	МассивСкладов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Склад");
	УстановитьПривилегированныйРежим(Ложь);
	
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаказДополнительныеДвижения.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаказДополнительныеДвижения.Количество) КАК Количество,
	|	ЗаказДополнительныеДвижения.Склад КАК Склад
	|ПОМЕСТИТЬ ТЗЗаказа
	|ИЗ
	|	Документ.Заказ.ДополнительныеДвижения КАК ЗаказДополнительныеДвижения
	|ГДЕ
	|	ЗаказДополнительныеДвижения.Ссылка В(&МассивРегистраторов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказДополнительныеДвижения.Номенклатура,
	|	ЗаказДополнительныеДвижения.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РезервыТМЦ.Склад КАК Склад,
	|	РезервыТМЦ.Номенклатура КАК Номенклатура,
	|	СУММА(РезервыТМЦ.Количество) КАК Количество
	|ПОМЕСТИТЬ ТЗРезервовЗаказа
	|ИЗ
	|	РегистрНакопления.РезервыТМЦ КАК РезервыТМЦ
	|ГДЕ
	|	РезервыТМЦ.Регистратор В(&МассивРегистраторов)
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыТМЦ.Склад,
	|	РезервыТМЦ.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, РезервыТМЦОстатки.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Склад, РезервыТМЦОстатки.Склад) КАК Склад,
	|	СУММА(ЕСТЬNULL(ОстаткиТМЦОстатки.КоличествоОстаток, 0) - ЕСТЬNULL(РезервыТМЦОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(ТЗРезервовЗаказа.Количество, 0)) КАК Остаток
	|ПОМЕСТИТЬ ТЗОстатков
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(
	|			,
	|			Склад В (&МассивСкладов)
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						ЗаказДополнительныеДвижения.Номенклатура КАК Номенклатура
	|					ИЗ
	|						Документ.Заказ.ДополнительныеДвижения КАК ЗаказДополнительныеДвижения
	|					ГДЕ
	|						ЗаказДополнительныеДвижения.Ссылка В (&МассивРегистраторов))) КАК ОстаткиТМЦОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РезервыТМЦ.Остатки(
	|				,
	|				Склад В (&МассивСкладов)
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ЗаказДополнительныеДвижения.Номенклатура КАК Номенклатура
	|						ИЗ
	|							Документ.Заказ.ДополнительныеДвижения КАК ЗаказДополнительныеДвижения
	|						ГДЕ
	|							ЗаказДополнительныеДвижения.Ссылка В (&МассивРегистраторов))) КАК РезервыТМЦОстатки
	|		ПО ОстаткиТМЦОстатки.Склад = РезервыТМЦОстатки.Склад
	|			И ОстаткиТМЦОстатки.Номенклатура = РезервыТМЦОстатки.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗРезервовЗаказа КАК ТЗРезервовЗаказа
	|		ПО ОстаткиТМЦОстатки.Склад = ТЗРезервовЗаказа.Склад
	|			И ОстаткиТМЦОстатки.Номенклатура = ТЗРезервовЗаказа.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Номенклатура, РезервыТМЦОстатки.Номенклатура),
	|	ЕСТЬNULL(ОстаткиТМЦОстатки.Склад, РезервыТМЦОстатки.Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗЗаказа.Номенклатура КАК Номенклатура,
	|	ТЗЗаказа.Количество КАК Количество,
	|	ТЗЗаказа.Склад КАК Склад,
	|	ЕСТЬNULL(ТЗОстатков.Остаток, 0) КАК Остаток
	|ИЗ
	|	ТЗЗаказа КАК ТЗЗаказа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗОстатков КАК ТЗОстатков
	|		ПО ТЗЗаказа.Номенклатура = ТЗОстатков.Номенклатура
	|			И ТЗЗаказа.Склад = ТЗОстатков.Склад
	|ГДЕ
	|	ЕСТЬNULL(ТЗОстатков.Остаток, 0) < 0";			  
	
	Ошибки="";
	МассивОшибок = Новый Массив;
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Результат.Следующий() Цикл
		МассивОшибок.Добавить("По номенклатуре "+Результат.Номенклатура+", на складе "+Результат.Склад+" недостаточно товара. На остатках - "+Результат.Остаток+" , требуется "+Результат.Количество);
	КонецЦикла;
	
	Если МассивОшибок.Количество()>0 Тогда
		Ошибки = СтрСоединить(МассивОшибок, Символы.ПС);
	КонецЕсли;
	
	Возврат Ошибки;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ОтменитьЗаказ(ЗаказСсылка) Экспорт
	
	ФлагПроведен = ЗаказСсылка.Проведен;
	
	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	Если ЗаказОбъект <> Неопределено Тогда
		
		Попытка
			ЗаказОбъект.Заблокировать();
		Исключение
			Возврат Ложь;
		КонецПопытки;
		
		ЗаказОбъект.СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО;
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			ЗаказОбъект.Записать(?(ФлагПроведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			ЗаказОбъект.Разблокировать();
			СообщитьИзМодуля("Документ " + Строка(ЗаказОбъект) + " отменен.");
		Исключение
			Возврат Ложь;
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
